## ðŸ“˜ Introduction to SQL (Fundamentals)

### What is Database ?
A Database is an organized collection of structured information, or data, typically stored electronically in a computer system.
Think of it as a digital filing cabinet. While a spreadsheet (like Excel) is great for one person to calculate numbers, a database 
is designed to hold massive amounts of data that many users can access and update at the same time securely.

### What is SQL?
SQL (Structured Query Language) is a standard language used to store, retrieve, and analyze data stored in relational databases.
In industry, SQL is used by:
- Data Analysts
- Business Analysts
- Data Scientists
- Analytics Engineers
- Backend Engineers   
Almost every company that works with data uses SQL in some form.

### Why SQL is Important for Data Analysis

SQL allows analysts to:
- Read large datasets efficiently
- Filter meaningful data
- Aggregate metrics (sales, revenue, users)
- Join data from multiple tables
- Answer business questions directly from databases   
Unlike Excel, SQL can handle millions of records reliably.

### Database Connection

In [3]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Test Connection

In [9]:
%%sql
SELECT version();

   mysql+pymysql://root:***@localhost/collage
 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('8.0.42',)]

### Create Table customers

In [10]:
%%sql 
# Drop table if it already exists (safe practice)
DROP TABLE IF EXISTS customers;
# Create customers table
CREATE TABLE customers (
customer_id INTEGER PRIMARY KEY,
name VARCHAR(50),
city VARCHAR(50),
age INTEGER,
signup_date DATE
);

   mysql+pymysql://root:***@localhost/collage
 * mysql+pymysql://root:***@localhost/customers
0 rows affected.
0 rows affected.

[]

### Insert Record in Table

In [17]:
%%sql 
#Insert sample records
INSERT INTO customers (customer_id, name, city, age, signup_date) VALUES
(1, 'Rahul', 'Mumbai', 24, '2023-01-10'),
(2, 'Ananya', 'Delhi', 27, '2023-02-15'),
(3, 'Aman', 'Pune', 22, '2023-03-01'),
(4, 'Neha', 'Mumbai', 29, '2023-01-20'),
(5, 'Karan', 'Bangalore', 31, '2023-04-05');

   mysql+pymysql://root:***@localhost/collage
 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[]

### Display all columns and all rows from the customers table.

In [22]:
%%sql
SELECT * from customers;

   mysql+pymysql://root:***@localhost/collage
 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5))]

### Display only the customer name and city from the customers table.

In [21]:
%%sql 
SELECT name,city from customers;

   mysql+pymysql://root:***@localhost/collage
 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Rahul', 'Mumbai'),
 ('Ananya', 'Delhi'),
 ('Aman', 'Pune'),
 ('Neha', 'Mumbai'),
 ('Karan', 'Bangalore')]